## 4개월 간 s-마트의 영수증 데이터를 이용하여 마케팅 전략을 수립하려 한다.

s_mart.csv

|컬럼|정의|type|
|:---|:---|:---:|
|goods|상품 구매 수|int64|
|purchases|결제 총 금액|float64|
|parking|주차 여부 (값이 0이면 주차하지 않음, 1이면 주차하였음)|int64|
|rental_bag|장바구니 대여 여부(값이 0이면 대여하지 않음, 1이면 소형 사이즈 대여, 2면 대형 사이즈 대여)|int64|
|date|결제 날짜|object|  

정답 및 해설 : https://tjd229.tistory.com/21

In [238]:
import pandas as pd
import numpy as np

df = pd.read_csv('../content/tjd229/s_mart.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8043 entries, 0 to 8042
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   goods       8043 non-null   int64
 1   purchases   6654 non-null   float64
 2   parking     8043 non-null   int64
 3   rental_bag  8043 non-null   int64
 4   date        8043 non-null   object
dtypes: float64(1), int64(3), object(1)
memory usage: 314.3+ KB

In [239]:
df.shape

(8043, 5)

In [240]:
df.describe()

             goods     purchases      parking   rental_bag
count  8043.000000  6.654000e+03  8043.000000  8043.000000
mean     15.474326  1.548129e+05     0.486137     1.202785
std       9.249488  1.675084e+05     0.499839     0.872374
min       0.000000  0.000000e+00     0.000000     0.000000
25%       7.000000  5.190750e+04     0.000000     0.000000
50%      15.000000  1.080450e+05     0.000000     2.000000
75%      23.000000  1.858050e+05     1.000000     2.000000
max      31.000000  1.430040e+06     1.000000     2.000000

In [241]:
df.head()

   goods  purchases  parking  rental_bag        date
0     25    96120.0        0           2  2023-02-07
1     13    49710.0        0           2  2022-11-18
2     28   247380.0        1           2  2023-02-20
3      3   174430.0        1           0  2022-12-10
4      8    35510.0        0           1  2022-11-19

### Q1. 여러 변수간 상관관계를 확인하고자 한다. 상품 구매 수(goods), 결제 총 금액(purchases), 주차 여부(parking), 장바구니 대여 여부(rental_bag)간 피어슨 상관분석을 수행하고 그 결과 중 상관계수 절대값이 가장 큰 값을 구하시오
※ 결측값이 포함된 데이터는 제거한 후에 상관분석을 수행하시오  
※ 정답은 반올림하여 소수점 첫째 자리까지 출력하시오.
(정답 예시: 22.9)

In [242]:
df1 = df.copy()

df1.isna().sum()   

# purchases 에만 결측 존재

goods            0
purchases     1389
parking          0
rental_bag       0
date             0
dtype: int64

In [243]:
df1_null = df1.loc[df1.purchases.notnull(),]

print(df1_null.shape)
df1_null.isna().sum()

(6654, 5)

goods         0
purchases     0
parking       0
rental_bag    0
date          0
dtype: int64

In [244]:
round(abs(df1_null.corr(method='pearson')).goods.sort_values(ascending = False)[1],1)

# goods 기준으로 sort 해서 제일 큰수

0.5

In [245]:
(abs(df1_null.corr(method='pearson')).goods.sort_values(ascending = False)).index.values[1]

# goods 와 상관관계가 제일 큰수를 갖은 column

'rental_bag'

### Q2. 특정 날짜 사이의 결제 총 금액(purchases) 평균을 구하려고 한다. 다음 단계에 따라 분석을 수행하고 질문에 답하시오.

단계 1 : 결측값(Null)이 포함된 모든 행을 제거하시오  
단계 2 : 단계 1을 수행한 데이터에서 결제 총 금액(purchases)이 49710인 날짜 st, 결제 총 금액(purchases)이 96120인 날짜 ed를 구한다.  
- st와 ed 조건을 만족하는 데이터는 유일하다.

단계 3 : 단계 2에서 구한 st와 ed 날짜 사이의 결제 총 금액(purchases) 평균을 구하시오(st와 ed 날도 포함한다.)  
  
※ 정답은 반올림하여 소수점 셋째 자리까지 출력하시오.
(정답 예시: 0.229)

In [321]:
df2 =df.copy()
df2.dropna(how ='any',inplace=True)
df2.isnull().sum()

goods         0
purchases     0
parking       0
rental_bag    0
date          0
dtype: int64

In [322]:
df2.tail()

      goods  purchases  parking  rental_bag        date
8037     22    95230.0        1           2  2022-12-08
8038      9    75870.0        0           1  2022-11-28
8039     21   159070.0        1           2  2022-12-20
8040     10    92720.0        0           0  2023-01-18
8041     13   764510.0        1           0  2023-01-05

In [323]:
df2.info()

# 중간에 drop 된 index 가 있어서 
# Int64Index: 6654 entries, 0 to 8041 
# 으로 표시 된다.

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6654 entries, 0 to 8041
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   goods       6654 non-null   int64
 1   purchases   6654 non-null   float64
 2   parking     6654 non-null   int64
 3   rental_bag  6654 non-null   int64
 4   date        6654 non-null   object
dtypes: float64(1), int64(3), object(1)
memory usage: 311.9+ KB

In [324]:
df2.reset_index(inplace = True ,drop = True)
df2.info()

# 인텍스를 다시 설정 0 ~ 6654

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6654 entries, 0 to 6653
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   goods       6654 non-null   int64
 1   purchases   6654 non-null   float64
 2   parking     6654 non-null   int64
 3   rental_bag  6654 non-null   int64
 4   date        6654 non-null   object
dtypes: float64(1), int64(3), object(1)
memory usage: 260.0+ KB

In [325]:
df2.tail()

      goods  purchases  parking  rental_bag        date
6649     22    95230.0        1           2  2022-12-08
6650      9    75870.0        0           1  2022-11-28
6651     21   159070.0        1           2  2022-12-20
6652     10    92720.0        0           0  2023-01-18
6653     13   764510.0        1           0  2023-01-05

In [326]:
df2.loc[df2.purchases == 49710, ]

# 원래부터가 index 가 1 이였네.

   goods  purchases  parking  rental_bag        date
1     13    49710.0        0           2  2022-11-18

😂 정수형 명목적 묵시적 인덱스의 구분

In [291]:

# st = df2.loc[df2.purchases == 49710, 'date'][1]      
# df 때부터 있던 원래 인덱스 [1] 를 넣어야 한다. 여기서는 우연히 0, 1 이라서 혼동됨
# [int] 인경우 명목적 인덱스로 간주한다. 

st = df2.loc[df2.purchases == 49710, 'date'].values[0]
st

# df2.loc[df2.purchases == 49710, 'date'] 은 왜 안될까?  Serise 라서
# 와
# df2.loc[df2.purchases == 49710, 'date'][0] 은 왜 안될까? [1] 이여만 할까? --> df 에서부터 갖고 있는 원래 인덱스[1] 를 넣어야 한다.

'2022-11-18'

In [289]:
print(df2.loc[df2.purchases == 96120, ['date']])
ed = df2.loc[df2.purchases == 96120, 'date'].values[0]
ed

# ed = df2.loc[df2.purchases == 96120, 'date'][1] 여기는 왜 이게 안될까?

         date
0  2023-02-07

'2023-02-07'

In [292]:
mask = (df2['date'] >= st) & (df2['date'] <= ed)
df2.loc[mask,'purchases']

0        96120.0
1        49710.0
3       174430.0
4        35510.0
5        90330.0
          ...
8037     95230.0
8038     75870.0
8039    159070.0
8040     92720.0
8041    764510.0
Name: purchases, Length: 4609, dtype: float64

### Q3. 데이터를 바탕으로 장바구니 대여 여부(rental_bag)를 예측하는 모델을 만드려고 한다. 다음 단계에 따라 분석을 수행하고 질문에 답하시오.

단계 1 : 결제 총 금액(purchases)의 결측 값(Null)을 결제 총 금액(purchases)의 평균값으로 대체한다.  
단계 2 : 장바구니 대여 여부(rental_bag) 컬럼 값을 대여하지 않은 경우는 0, 대여한 경우는 종류에 상관없이 1로 변환한다.  
단계 3 : 날짜가 2월이 아닌 데이터를 Train Set으로, 2월인 데이터를 Test Set으로 분할한다.  
단계 4 : 상품 구매 수(goods)와 결제 총 금액(purchases) 컬럼에 대해 Train Set을 기준으로 Z-score 표준화(Standardization) 한다.  
단계 5 : Train Set으로 아래 조건에 따라 로지스틱 회귀분석을 학습한다.  
- 독립 변수 : 상품 구매 수(goods), 결제 총 금액(purchases), 주차 여부(parking)  
- 종속 변수 : 장바구니 대여 여부(rental_bag)  

단계 6 : 단계 5에서 학습한 모델을 Test Set에 적용하여 장바구니 대여 여부(rental_bag)를 예측한다. Test Set에 주어진 종속 변수를 활용하여 F1-score로 모델을 평가하시오  
            
※ 정답은 반올림하여 소수점 둘째 자리까지 출력하시오.  
(정답 예시: 2.29)

In [257]:
df3 = df.copy()
df3.isna().sum()

goods            0
purchases     1389
parking          0
rental_bag       0
date             0
dtype: int64

In [260]:
df3.fillna(df3.purchases.mean(), inplace=True)

In [261]:
df3.isna().sum()

goods         0
purchases     0
parking       0
rental_bag    0
date          0
dtype: int64

In [262]:
df3.rental_bag.unique()

array([2, 0, 1])

In [264]:
df3[df3.rental_bag == 2] = 1

In [265]:
df3.rental_bag.unique()

array([1, 0])

#### 필요 라이브러리 함수,클래스 및 설정값 목록  


from sklearn.linear_model import LogisticRegression  
from sklearn.preprocessing import StandardScaler  
from sklearn.metrics import f1_score  
random_state = 229  
문제 지시 외 Default 값 사용